Repository: phanvantai/quick_spend
Catalog: QuickSpend/Localizable.xcstrings
Source language: en
Languages: es, ja, vi

# premium_status.active_description
source: You're enjoying all premium features
es: Estás disfrutando de todas las funciones premium
ja: すべてのプレミアム機能をご利用いただけます
vi: Bạn đang sử dụng tất cả tính năng cao cấp

# premium_status.feature_requests
source: Feature Requests
es: Solicitudes de funciones
ja: 機能リクエスト
vi: Yêu cầu tính năng

# premium_status.feature_requests_desc
source: Submit and vote on feature ideas
es: Envía y vota ideas de funciones
ja: 機能のアイデアを送信・投票
vi: Gửi và bình chọn ý tưởng tính năng

# premium_status.thank_you
source: Thank you for supporting Quick Spend! Your subscription helps us keep improving the app.
es: ¡Gracias por apoyar Quick Spend! Tu suscripción nos ayuda a seguir mejorando la app.
ja: Quick Spendをご支援いただきありがとうございます！ご購読がアプリの改善に役立っています。
vi: Cảm ơn bạn đã ủng hộ Quick Spend! Đăng ký của bạn giúp chúng tôi tiếp tục cải thiện ứng dụng.

# recurring_form.add_title
source: Add Recurring
es: Añadir recurrente
ja: 定期を追加
vi: Thêm định kỳ

# recurring_form.edit_title
source: Edit Recurring
es: Editar recurrente
ja: 定期を編集
vi: Sửa định kỳ

# recurring_form.end_date
source: End Date
es: Fecha de fin
ja: 終了日
vi: Ngày kết thúc

# recurring_form.has_end_date
source: Has End Date
es: Tiene fecha de fin
ja: 終了日あり
vi: Có ngày kết thúc

# recurring_form.pattern
source: Pattern
es: Patrón
ja: パターン
vi: Chu kỳ

# recurring_form.pattern_daily
source: Daily
es: Diario
ja: 毎日
vi: Ngày

# recurring_form.pattern_monthly
source: Monthly
es: Mensual
ja: 毎月
vi: Tháng

# recurring_form.pattern_weekly
source: Weekly
es: Semanal
ja: 毎週
vi: Tuần

# recurring_form.pattern_yearly
source: Yearly
es: Anual
ja: 毎年
vi: Năm

# recurring_form.placeholder
source: e.g. Monthly rent, Netflix
es: ej. Renta mensual, Netflix
ja: 例：家賃、Netflix
vi: VD: Tiền nhà, Netflix

# recurring_form.recurrence
source: Recurrence
es: Recurrencia
ja: 繰り返し
vi: Tần suất

# recurring_form.schedule
source: Schedule
es: Horario
ja: スケジュール
vi: Lịch trình

# recurring_form.start_date
source: Start Date
es: Fecha de inicio
ja: 開始日
vi: Ngày bắt đầu

# recurring.daily
source: Daily
es: Diario
ja: 毎日
vi: Hàng ngày

# recurring.delete_message
source: Delete "%@"? Previously generated transactions will not be removed.
es: ¿Eliminar "%@"? Las transacciones generadas anteriormente no se eliminarán.
ja: "%@"を削除しますか？以前生成された取引は削除されません。
vi: Xóa "%@"? Các giao dịch đã tạo trước đó sẽ không bị xóa.

# recurring.delete_title
source: Delete Template
es: Eliminar plantilla
ja: テンプレートを削除
vi: Xóa mẫu

# recurring.limit_message
source: Free plan allows %lld recurring templates. Upgrade to Pro for unlimited.
es: El plan gratuito permite %lld plantillas recurrentes. Actualiza a Pro para obtener uso ilimitado.
ja: 無料プランでは定期テンプレートは%lld個までです。Proにアップグレードすると無制限になります。
vi: Gói miễn phí giới hạn %lld mẫu định kỳ. Nâng cấp Pro để không giới hạn.

# recurring.limit_title
source: Limit Reached
es: Límite alcanzado
ja: 上限に達しました
vi: Đã đạt giới hạn

# recurring.monthly
source: Monthly
es: Mensual
ja: 毎月
vi: Hàng tháng

# recurring.no_templates
source: No Recurring Templates
es: Sin plantillas recurrentes
ja: 定期テンプレートなし
vi: Chưa có mẫu định kỳ

# recurring.no_templates_desc
source: Create a template to automatically generate transactions on a schedule.
es: Crea una plantilla para generar transacciones automáticamente según un horario.
ja: テンプレートを作成して、スケジュールに従って自動的に取引を生成します。
vi: Tạo mẫu để tự động sinh giao dịch theo lịch.

# recurring.title
source: Recurring
es: Recurrentes
ja: 定期
vi: Định kỳ

# recurring.weekly
source: Weekly
es: Semanal
ja: 毎週
vi: Hàng tuần

# recurring.yearly
source: Yearly
es: Anual
ja: 毎年
vi: Hàng năm

# report.last_month
source: Last Month
es: Mes anterior
ja: 先月
vi: Tháng trước

# report.this_month
source: This Month
es: Este mes
ja: 今月
vi: Tháng này

# report.three_months
source: 3 Months
es: 3 meses
ja: 3ヶ月
vi: 3 tháng

# report.title
source: Report
es: Reporte
ja: レポート
vi: Báo cáo

# report.transaction_count
source: %lld transactions
es: %lld transacciones
ja: %lld件の取引
vi: %lld giao dịch

source: Response
es: Respuesta
ja: 回答
vi: Phản hồi

source: Select Month
es: Seleccionar mes
ja: 月を選択
vi: Chọn tháng

# settings.balance
source: Opening balance
es: Saldo inicial
ja: 開始残高
vi: Số dư tài khoản

# settings.balance_subtitle
source: Your starting amount for balance tracking
es: Tu importe inicial para seguimiento de saldo
ja: 残高追跡の開始金額
vi: Số tiền bắt đầu để theo dõi số dư

# settings.categories
source: Categories
es: Categorías
ja: カテゴリ
vi: Danh mục

# settings.categories_subtitle
source: Manage categories
es: Administrar categorías
ja: カテゴリを管理
vi: Quản lý danh mục

# settings.currency
source: Currency
es: Moneda
ja: 通貨
vi: Tiền tệ

# settings.currency_locked_hint
source: Currency cannot be changed after adding transactions. Delete all transactions first to change currency.
es: No se puede cambiar la moneda después de agregar transacciones. Elimine todas las transacciones primero para cambiar la moneda.
ja: 取引を追加した後は通貨を変更できません。通貨を変更するには、すべての取引を削除してください。
vi: Không thể thay đổi tiền tệ sau khi đã có giao dịch. Xóa tất cả giao dịch để thay đổi tiền tệ.

# settings.data
source: Data
es: Datos
ja: データ
vi: Dữ liệu

# settings.delete_all_data
source: Delete All Data
es: Eliminar todos los datos
ja: すべてのデータを削除
vi: Xóa tất cả dữ liệu

# settings.delete_all_data_confirm_message
source: This will permanently delete all transactions, categories, and recurring templates. If iCloud sync is enabled, data will also be removed from iCloud. This action cannot be undone.
es: Se eliminarán permanentemente todas las transacciones, categorías y plantillas recurrentes. Si la sincronización de iCloud está activada, los datos también se eliminarán de iCloud. Esta acción no se puede deshacer.
ja: すべての取引、カテゴリ、定期テンプレートが完全に削除されます。iCloud同期が有効な場合、iCloudからも削除されます。この操作は元に戻せません。
vi: Thao tác này sẽ xóa vĩnh viễn tất cả giao dịch, danh mục và mẫu định kỳ. Nếu đồng bộ iCloud đang bật, dữ liệu cũng sẽ bị xóa khỏi iCloud. Không thể hoàn tác.

# settings.delete_all_data_confirm_title
source: Delete All Data?
es: ¿Eliminar todos los datos?
ja: すべてのデータを削除しますか？
vi: Xóa tất cả dữ liệu?

# settings.delete_all_data_subtitle
source: Remove all transactions and reset app
es: Eliminar todas las transacciones y restablecer
ja: すべての取引を削除してアプリをリセット
vi: Xóa tất cả giao dịch và đặt lại ứng dụng

# settings.feature_request_subtitle
source: Submit ideas & suggestions
es: Envía ideas y sugerencias
ja: アイデアや提案を送信
vi: Gửi ý tưởng và đề xuất

# settings.icloud_connected
source: Connected
es: Conectado
ja: 接続済み
vi: Đã kết nối

# settings.icloud_no_account
source: No iCloud account
es: Sin cuenta de iCloud
ja: iCloudアカウントなし
vi: Chưa đăng nhập iCloud

# settings.icloud_restricted
source: Restricted
es: Restringido
ja: 制限されています
vi: Bị hạn chế

# settings.icloud_sync
source: iCloud Sync
es: Sincronización iCloud
ja: iCloud同期
vi: Đồng bộ iCloud

# settings.icloud_synced
source: Synced
es: Sincronizado
ja: 同期済み
vi: Đã đồng bộ

# settings.icloud_syncing
source: Syncing…
es: Sincronizando…
ja: 同期中…
vi: Đang đồng bộ…

# settings.icloud_unavailable
source: Temporarily unavailable
es: No disponible temporalmente
ja: 一時的に利用不可
vi: Tạm thời không khả dụng

# settings.icloud_unknown
source: Checking…
es: Verificando…
ja: 確認中…
vi: Đang kiểm tra…

# settings.language
source: Display Language
es: Idioma de interfaz
ja: 表示言語
vi: Ngôn ngữ hiển thị

# settings.language_hint
source: Display Language sets the app interface. Speech Language sets voice recognition and AI parsing — change it if you speak a different language.
es: Idioma de interfaz configura la interfaz. Idioma de voz configura el reconocimiento de voz y el análisis IA — cámbialo si hablas en otro idioma.
ja: 表示言語はアプリの表示に使用されます。音声言語は音声認識とAI解析に使用されます。別の言語で話す場合は変更してください。
vi: Ngôn ngữ hiển thị dùng cho giao diện. Ngôn ngữ giọng nói dùng cho nhận dạng giọng nói và phân tích AI — thay đổi nếu bạn nói ngôn ngữ khác.

# settings.preferences
source: Preferences
es: Preferencias
ja: 設定
vi: Tùy chọn

# settings.premium_active
source: Active
es: Activo
ja: 有効
vi: Đang hoạt động

# settings.recurring
source: Recurring
es: Recurrentes
ja: 定期
vi: Định kỳ

# settings.recurring_subtitle
source: Manage recurring transactions
es: Administrar transacciones recurrentes
ja: 定期取引を管理
vi: Quản lý giao dịch định kỳ

# settings.restore_subtitle
source: Already purchased? Restore here
es: ¿Ya compraste? Restaura aquí
ja: 購入済み？ここで復元
vi: Đã mua? Khôi phục tại đây

# settings.restore_success
source: Your Premium subscription has been restored successfully!
es: ¡Tu suscripción Premium ha sido restaurada exitosamente!
ja: Premiumサブスクリプションが正常に復元されました！
vi: Gói Premium đã được khôi phục thành công!

# settings.speech_language
source: Speech Language
es: Idioma de voz
ja: 音声言語
vi: Ngôn ngữ giọng nói

# settings.subscription
source: Subscription
es: Suscripción
ja: サブスクリプション
vi: Gói đăng ký

# settings.theme
source: Theme
es: Tema
ja: テーマ
vi: Giao diện

# settings.theme_dark
source: Dark
es: Oscuro
ja: ダーク
vi: Tối

# settings.theme_light
source: Light
es: Claro
ja: ライト
vi: Sáng

# settings.theme_system
source: System
es: Sistema
ja: システム
vi: Hệ thống

# settings.title
source: Settings
es: Ajustes
ja: 設定
vi: Cài đặt

# settings.unlock_features
source: Unlock unlimited features
es: Desbloquea funciones ilimitadas
ja: 無制限の機能を解放
vi: Mở khóa tính năng không giới hạn

# settings.version
source: Version
es: Versión
ja: バージョン
vi: Phiên bản

source: Status
es: Estado
ja: ステータス
vi: Trạng thái

# sync.checking_data
source: Checking your data…
es: Verificando tus datos…
ja: データを確認中…
vi: Đang kiểm tra dữ liệu…

# transactions.all
source: All
es: Todo
ja: すべて
vi: Tất cả

# transactions.count
source: %lld transactions
es: %lld transacciones
ja: %lld件の取引
vi: %lld giao dịch

# transactions.delete_confirm
source: Are you sure you want to delete this transaction?
es: ¿Estás seguro de que deseas eliminar esta transacción?
ja: この取引を削除してもよろしいですか？
vi: Bạn có chắc chắn muốn xóa giao dịch này không?

# transactions.filter_expense
source: Expense
es: Gasto
ja: 支出
vi: Tiền ra

# transactions.filter_income
source: Income
es: Ingreso
ja: 収入
vi: Tiền vào

# transactions.low_confidence
source: Low confidence
es: Baja confianza
ja: 信頼度が低い
vi: Độ chính xác thấp

# transactions.other
source: Other
es: Otros
ja: その他
vi: Khác

# transactions.title
source: Transactions
es: Transacciones
ja: 取引
vi: Giao dịch

source: Type
es: Tipo
ja: 種類
vi: Loại

# voice_review.confirm_title
source: Confirm Transaction
es: Confirmar transacción
ja: 取引を確認
vi: Xác nhận giao dịch

# voice_review.low_confidence
source: Low confidence - please verify
es: Baja confianza - por favor verifica
ja: 信頼度が低い - 確認してください
vi: Độ chính xác thấp - vui lòng kiểm tra

# voice_review.transaction
source: Transaction
es: Transacción
ja: 取引
vi: Giao dịch

# voice_review.transaction_n
source: Transaction %lld
es: Transacción %lld
ja: 取引 %lld
vi: Giao dịch %lld

# voice_review.transactions_parsed
source: %lld Transactions Parsed
es: %lld transacciones analizadas
ja: %lld件の取引を解析
vi: %lld giao dịch

# voice_shortcut.install_cta
source: Add to Shortcuts
es: Añadir a Atajos
ja: ショートカットに追加
vi: Thêm vào Phím tắt

# voice_shortcut.later_cta
source: Maybe later
es: Quizás más tarde
ja: あとで
vi: Để sau

# voice_shortcut.promo_benefit_1
source: Trigger from the Action Button, Lock Screen, or Hey Siri.
es: Activa con el Botón de Acción, la Pantalla Bloqueada o Oye Siri.
ja: アクションボタン、ロック画面、または「Hey Siri」から起動。
vi: Kích hoạt từ Nút Tác vụ, Màn hình khoá, hoặc Hey Siri.

# voice_shortcut.promo_benefit_2
source: Speak naturally — QuickSpend parses the amount, category, and date.
es: Habla con naturalidad — Gasto Rápido extrae el monto, la categoría y la fecha.
ja: 自然に話すだけで、クイック支出が金額・カテゴリ・日付を解析します。
vi: Nói tự nhiên — Chi tiêu nhanh tự phân tích số tiền, danh mục và ngày.

# voice_shortcut.promo_benefit_3
source: Confirm once, save silently. No keyboard, no app open.
es: Confirma una vez, guarda en silencio. Sin teclado, sin abrir la app.
ja: 一度確認するだけで静かに保存。キーボードもアプリ起動も不要。
vi: Xác nhận một lần, lưu im lặng. Không bàn phím, không cần mở app.

# voice_shortcut.promo_subtitle
source: Tap once, speak the expense, done. No need to open QuickSpend.
es: Toca una vez, di el gasto, listo. Sin abrir Gasto Rápido.
ja: 1タップで支出を声に出して登録。クイック支出を開く必要なし。
vi: Một chạm, nói khoản chi, xong. Không cần mở Chi tiêu nhanh.

# voice_shortcut.promo_title
source: Log expenses by voice
es: Registra gastos por voz
ja: 声で支出を記録
vi: Ghi chi tiêu bằng giọng nói

# voice_shortcut.settings_subtitle
source: Open Shortcuts to add the voice shortcut
es: Abre Atajos para añadir el atajo de voz
ja: ショートカットを開いて音声ショートカットを追加
vi: Mở Phím tắt để thêm phím tắt giọng nói

# voice_shortcut.settings_title
source: Voice Shortcut
es: Atajo de voz
ja: 音声ショートカット
vi: Phím tắt giọng nói

# voice.hint
source: Double tap to add an expense using your voice
es: Toca dos veces para agregar un gasto con tu voz
ja: ダブルタップで音声入力
vi: Nhấn đúp để thêm giao dịch bằng giọng nói

source: Voice input
es: Entrada de voz
ja: 音声入力
vi: Nhập giọng nói

# voice.listening
source: Listening...
es: Escuchando...
ja: 聞いています...
vi: Đang nghe...

# voice.parse_failed
source: Couldn't understand. Please enter manually.
es: No se pudo entender. Por favor, ingrese manualmente.
ja: 認識できませんでした。手動で入力してください。
vi: Không thể nhận diện. Vui lòng nhập thủ công.

# voice.release_cancel
source: Release to cancel
es: Suelta para cancelar
ja: 離すとキャンセル
vi: Thả để hủy

# voice.tutorial_subtitle
source: Drag away to cancel
es: Arrastra lejos para cancelar
ja: ドラッグでキャンセル
vi: Kéo ra xa để hủy

# voice.tutorial_title
source: Hold to record, release to send
es: Mantén para grabar, suelta para enviar
ja: 長押しで録音、離して送信
vi: Giữ để ghi âm, thả để gửi

source: What did you spend on? Include the amount.
es: ¿En qué gastaste? Incluye el monto.
ja: 何に使いましたか？金額も含めて教えてください。
vi: Bạn chi cho việc gì? Nhớ kèm số tiền.

source: What expense should I add?
es: ¿Qué gasto debo añadir?
ja: どんな支出を追加しますか？
vi: Bạn muốn thêm chi tiêu gì?

# category_form.color
source: Color
ja: カラー
vi: Màu sắc

# category_group.personal
source: Personal
ja: 個人
vi: Cá nhân

# category_group.social
source: Social
ja: 社会
vi: Xã hội

# common.balance
source: Balance
ja: 残高
vi: Khoản dư

# intent.snippet.total
source: Total
ja: 合計
vi: Tổng

# paywall.premium_label
source: Premium
ja: プレミアム
vi: Cao cấp
